Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/hstx_ctrl.h
//               set, but INV can still be set to generate an antiphase clock.
#define HSTX_CTRL_BIT7_CLK_RESET  _u(0x0)
#define HSTX_CTRL_BIT7_CLK_BITS   _u(0x00020000)
#define HSTX_CTRL_BIT7_CLK_MSB    _u(17)
#define HSTX_CTRL_BIT7_CLK_LSB    _u(17)
#define HSTX_CTRL_BIT7_CLK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_BIT7_INV
// Description : Invert this data output (logical NOT)
#define HSTX_CTRL_BIT7_INV_RESET  _u(0x0)
#define HSTX_CTRL_BIT7_INV_BITS   _u(0x00010000)
#define HSTX_CTRL_BIT7_INV_MSB    _u(16)
#define HSTX_CTRL_BIT7_INV_LSB    _u(16)
#define HSTX_CTRL_BIT7_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_BIT7_SEL_N
// Description : Shift register data bit select for the second half of the HSTX
//               clock cycle
#define HSTX_CTRL_BIT7_SEL_N_RESET  _u(0x00)
#define HSTX_CTRL_BIT7_SEL_N_BITS   _u(0x00001f00)
#define HSTX_CTRL_BIT7_SEL_N_MSB    _u(12)
#define HSTX_CTRL_BIT7_SEL_N_LSB    _u(8)
#define HSTX_CTRL_BIT7_SEL_N_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_BIT7_SEL_P
// Description : Shift register data bit select for the first half of the HSTX
//               clock cycle
#define HSTX_CTRL_BIT7_SEL_P_RESET  _u(0x00)
#define HSTX_CTRL_BIT7_SEL_P_BITS   _u(0x0000001f)
#define HSTX_CTRL_BIT7_SEL_P_MSB    _u(4)
#define HSTX_CTRL_BIT7_SEL_P_LSB    _u(0)
#define HSTX_CTRL_BIT7_SEL_P_ACCESS "RW"
// =============================================================================
// Register    : HSTX_CTRL_EXPAND_SHIFT
// Description : Configure the optional shifter inside the command expander
#define HSTX_CTRL_EXPAND_SHIFT_OFFSET _u(0x00000024)
#define HSTX_CTRL_EXPAND_SHIFT_BITS   _u(0x1f1f1f1f)
#define HSTX_CTRL_EXPAND_SHIFT_RESET  _u(0x01000100)
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS
// Description : Number of times to consume from the shift register before
//               refilling it from the FIFO, when the current command is an
//               encoded data command (e.g. TMDS). A register value of 0 means
//               shift 32 times.
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_RESET  _u(0x01)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_BITS   _u(0x1f000000)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_MSB    _u(28)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_LSB    _u(24)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_N_SHIFTS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT
// Description : How many bits to right-rotate the shift register by each time
//               data is pushed to the output shifter, when the current command
//               is an encoded data command (e.g. TMDS).
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_RESET  _u(0x00)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_BITS   _u(0x001f0000)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_MSB    _u(20)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_LSB    _u(16)
#define HSTX_CTRL_EXPAND_SHIFT_ENC_SHIFT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS
// Description : Number of times to consume from the shift register before
//               refilling it from the FIFO, when the current command is a raw
//               data command. A register value of 0 means shift 32 times.
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_RESET  _u(0x01)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_BITS   _u(0x00001f00)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_MSB    _u(12)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_LSB    _u(8)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_N_SHIFTS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT
// Description : How many bits to right-rotate the shift register by each time
//               data is pushed to the output shifter, when the current command
//               is a raw data command.
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_RESET  _u(0x00)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_BITS   _u(0x0000001f)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_MSB    _u(4)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_LSB    _u(0)
#define HSTX_CTRL_EXPAND_SHIFT_RAW_SHIFT_ACCESS "RW"
// =============================================================================
// Register    : HSTX_CTRL_EXPAND_TMDS
// Description : Configure the optional TMDS encoder inside the command expander
#define HSTX_CTRL_EXPAND_TMDS_OFFSET _u(0x00000028)
#define HSTX_CTRL_EXPAND_TMDS_BITS   _u(0x00ffffff)
#define HSTX_CTRL_EXPAND_TMDS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L2_NBITS
// Description : Number of valid data bits for the lane 2 TMDS encoder, starting
//               from bit 7 of the rotated data. Field values of 0 -> 7 encode
//               counts of 1 -> 8 bits.
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_RESET  _u(0x0)
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_BITS   _u(0x00e00000)
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_MSB    _u(23)
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_LSB    _u(21)
#define HSTX_CTRL_EXPAND_TMDS_L2_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L2_ROT
// Description : Right-rotate applied to the current shifter data before the
//               lane 2 TMDS encoder.
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_RESET  _u(0x00)
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_BITS   _u(0x001f0000)
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_MSB    _u(20)
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_LSB    _u(16)
#define HSTX_CTRL_EXPAND_TMDS_L2_ROT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L1_NBITS
// Description : Number of valid data bits for the lane 1 TMDS encoder, starting
//               from bit 7 of the rotated data. Field values of 0 -> 7 encode
//               counts of 1 -> 8 bits.
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_RESET  _u(0x0)
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_BITS   _u(0x0000e000)
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_MSB    _u(15)
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_LSB    _u(13)
#define HSTX_CTRL_EXPAND_TMDS_L1_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L1_ROT
// Description : Right-rotate applied to the current shifter data before the
//               lane 1 TMDS encoder.
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_RESET  _u(0x00)
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_BITS   _u(0x00001f00)
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_MSB    _u(12)
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_LSB    _u(8)
#define HSTX_CTRL_EXPAND_TMDS_L1_ROT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L0_NBITS
// Description : Number of valid data bits for the lane 0 TMDS encoder, starting
//               from bit 7 of the rotated data. Field values of 0 -> 7 encode
//               counts of 1 -> 8 bits.
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_RESET  _u(0x0)
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_BITS   _u(0x000000e0)
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_MSB    _u(7)
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_LSB    _u(5)
#define HSTX_CTRL_EXPAND_TMDS_L0_NBITS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : HSTX_CTRL_EXPAND_TMDS_L0_ROT
// Description : Right-rotate applied to the current shifter data before the
//               lane 0 TMDS encoder.
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_RESET  _u(0x00)
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_BITS   _u(0x0000001f)
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_MSB    _u(4)
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_LSB    _u(0)
#define HSTX_CTRL_EXPAND_TMDS_L0_ROT_ACCESS "RW"
// =============================================================================
#endif // _HARDWARE_REGS_HSTX_CTRL_H

